In [20]:
import pandas as pd
import numpy as np

In [21]:
test_data = pd.DataFrame([[1, 2, np.nan], [3, np.nan, 4], [0, 1, 2]], columns=['A', 'B', 'C'])

In [22]:
test_data

   A    B    C
0  1  2.0  NaN
1  3  NaN  4.0
2  0  1.0  2.0

In [23]:
test_data.isna()

       A      B      C
0  False  False   True
1  False   True  False
2  False  False  False

In [24]:
test_data['A'].isna()

0    False
1    False
2    False
Name: A, dtype: bool

In [25]:
test_data['B'].isna()

0    False
1     True
2    False
Name: B, dtype: bool

In [26]:
test_data['C'].isna()

0     True
1    False
2    False
Name: C, dtype: bool

In [27]:
test_data.dropna(axis=0)

   A    B    C
2  0  1.0  2.0

In [28]:
test_data

   A    B    C
0  1  2.0  NaN
1  3  NaN  4.0
2  0  1.0  2.0

In [29]:
test_data.dropna(axis=1)

   A
0  1
1  3
2  0

In [30]:
test_data

   A    B    C
0  1  2.0  NaN
1  3  NaN  4.0
2  0  1.0  2.0

In [31]:
test_data.dropna()

   A    B    C
2  0  1.0  2.0

In [32]:
test_data.dropna(subset=[0], axis=1)

   A    B
0  1  2.0
1  3  NaN
2  0  1.0

In [33]:
test_data.dropna(subset=['B'], axis=0)

   A    B    C
0  1  2.0  NaN
2  0  1.0  2.0

In [34]:
###################################################################

## Заполнение статистиками

Иногда удаление строк/столбцов с пропусками - слишком грубое решение. Можно заменять пропуски статистиками или каким-то константным значением с помощью метода `fillna()`:

In [35]:
test_data.fillna(-1)

   A    B    C
0  1  2.0 -1.0
1  3 -1.0  4.0
2  0  1.0  2.0

Можно заменять разными статистиками, например:
 - среднее значение, `np.mean()`
 - максимальное значение, `np.max()`
 - минимальное значение, `np.min()`
 - медиана, `np.median()`

In [38]:
max_two = np.max(test_data['B'])
test_data['B'].fillna(max_two)

0    2.0
1    2.0
2    1.0
Name: B, dtype: float64

In [39]:
test_data['C'].fillna(test_data['C'].mean())

0    3.0
1    4.0
2    2.0
Name: C, dtype: float64

In [40]:
test_data['C'].fillna(test_data['C'].max())

0    4.0
1    4.0
2    2.0
Name: C, dtype: float64